robotics-at-maryland/qubo/embedded/drivers/tivaware/examples/boards/ek-tm4c123gxl-boostxl-kentec-s1/drivers/Kentec320x240x16_ssd2119_spi.c
#define LCD_DC_PERIPH           SYSCTL_PERIPH_GPIOA
#define LCD_DC_BASE             GPIO_PORTA_BASE
#define LCD_DC_PIN              GPIO_PIN_5

#define LCD_RST_PERIPH          SYSCTL_PERIPH_GPIOD
#define LCD_RST_BASE            GPIO_PORTD_BASE
#define LCD_RST_PIN             GPIO_PIN_7

#define LCD_LED_PERIPH          SYSCTL_PERIPH_GPIOF
#define LCD_LED_BASE            GPIO_PORTF_BASE
#define LCD_LED_PIN             GPIO_PIN_2

//*****************************************************************************
//
// Defines for the SSI controller and pins that are used to communicate with
// the SSD2119.
//
//*****************************************************************************
#define LCD_SSI_PERIPH          SYSCTL_PERIPH_SSI2
#define LCD_SSI_BASE            SSI2_BASE

#define LCD_SSI_GPIO_PERIPH     SYSCTL_PERIPH_GPIOB
#define LCD_SSI_GPIO_BASE       GPIO_PORTB_BASE
#define LCD_SSI_CLK_CFG         GPIO_PB4_SSI2CLK
#define LCD_SSI_TX_CFG          GPIO_PB7_SSI2TX
#define LCD_SSI_CLK_PIN         GPIO_PIN_4
#define LCD_SSI_TX_PIN          GPIO_PIN_7

//*****************************************************************************
//
// The dimensions of the LCD panel.
//
//*****************************************************************************
#define LCD_VERTICAL_MAX 240
#define LCD_HORIZONTAL_MAX 320

//*****************************************************************************
//
// Translates a 24-bit RGB color to a display driver-specific color.
//
// \param c is the 24-bit RGB color.  The least-significant byte is the blue
// channel, the next byte is the green channel, and the third byte is the red
// channel.
//
// This macro translates a 24-bit RGB color into a value that can be written
// into the display's frame buffer in order to reproduce that color, or the
// closest possible approximation of that color.
//
// \return Returns the display-driver specific color.
//
//*****************************************************************************
#define DPYCOLORTRANSLATE(c)    ((((c) & 0x00f80000) >> 8) |               \
                                 (((c) & 0x0000fc00) >> 5) |               \
                                 (((c) & 0x000000f8) >> 3))

//*****************************************************************************
//
// Switches Backlight ON for the LCD Panel
//
//*****************************************************************************
static inline void
LED_ON(void)
{
    GPIOPinWrite(LCD_LED_BASE, LCD_LED_PIN, LCD_LED_PIN);
}

//*****************************************************************************
//
// Switches Backlight OFF for the LCD Panel
//
//*****************************************************************************
static inline void
LED_OFF(void)
{
    GPIOPinWrite(LCD_LED_BASE, LCD_LED_PIN, 0);
}

//*****************************************************************************
//
// Writes a data word to the SSD2119.
//
//*****************************************************************************
static inline void
WriteDataSPI(uint16_t ui16Data)
{
    uint16_t pui16Data[2];

    //
    // Write the most significant byte of the data to the bus.
    //
    pui16Data[0] = (ui16Data >> 8);
    
    //
    // Write the least significant byte of the data to the bus.
    //
    pui16Data[1] = ui16Data;

    GPIOPinWrite(LCD_DC_BASE, LCD_DC_PIN, LCD_DC_PIN);
    GPIOPinWrite(LCD_CS_BASE, LCD_CS_PIN, 0);

    SSIDataPut(LCD_SSI_BASE, pui16Data[0]);
    SSIDataPut(LCD_SSI_BASE, pui16Data[1]);

    //
    // Wait until SSI0 is done transferring all the data in the transmit FIFO.
    //
    while(SSIBusy(LCD_SSI_BASE)){ }

    GPIOPinWrite(LCD_CS_BASE, LCD_CS_PIN, LCD_CS_PIN);
}

//*****************************************************************************
//
// Writes a command to the SSD2119.
//
//*****************************************************************************
static inline void
WriteCommandSPI(uint16_t ui16Data)
{
    uint16_t pui16Data[2];

    //
    // Write the most significant byte of the data to the bus.
    //
    pui16Data[0] = 0;
    
    //
    // Write the least significant byte of the data to the bus.
    //
    pui16Data[1] = ui16Data;

    GPIOPinWrite(LCD_DC_BASE, LCD_DC_PIN, 0);
    GPIOPinWrite(LCD_CS_BASE, LCD_CS_PIN, 0);

    SSIDataPut(LCD_SSI_BASE, pui16Data[0]);
    SSIDataPut(LCD_SSI_BASE, pui16Data[1]);
    
    //
    // Wait until SSI0 is done transferring all the data in the transmit FIFO.
    //
    while(SSIBusy(LCD_SSI_BASE)){ }

    GPIOPinWrite(LCD_CS_BASE, LCD_CS_PIN, LCD_CS_PIN);
}

//*****************************************************************************
//
// Initializes the pins required for the GPIO-based LCD interface.
//
// This function configures the GPIO pins used to control the LCD display
// when the basic GPIO interface is in use.  On exit, the LCD controller
// has been reset and is ready to receive command and data writes.
//
// \return None.
//
//*****************************************************************************
static void
InitSPILCDInterface(uint32_t ui32SysClock)
{
    uint32_t pui32DataRx[3];

    //
    // The SSI2 peripheral must be enabled for use.
    //
    SysCtlPeripheralEnable(LCD_SSI_PERIPH);

    //
    // For this example SSI2 is used with PortB[7:4].  The actual port and pins
    // used may be different on your part, consult the data sheet for more
    // information.  GPIO port Q needs to be enabled so these pins can be used.
    // TODO: change this to whichever GPIO port you are using.
    //
    SysCtlPeripheralEnable(LCD_SSI_GPIO_PERIPH);

    //
    // Enable the PortP for LCD_SCS, LCD_SDC
    // Enable the PortK for LCD_RST
    // Enable the PortG for LED backlight
    //
    SysCtlPeripheralEnable(LCD_RST_PERIPH);
    SysCtlPeripheralEnable(LCD_LED_PERIPH);
    SysCtlPeripheralEnable(LCD_CS_PERIPH);

    //
    // Unlock PF0 and PD7 pins
    //
    HWREG(LCD_RST_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY;
    HWREG(LCD_RST_BASE + GPIO_O_CR)   = 0xFF;
    HWREG(LCD_RST_BASE + GPIO_O_LOCK) = ~(GPIO_LOCK_KEY);

